In [1]:
import numpy as np
import pandas as pd

In [2]:
L = [1,2,3,5]
pd.Series(L)

0    1
1    2
2    3
3    5
dtype: int64

In [3]:
L=[1,2,3,5]
pd.Series(L, index=['a', 'b', 'c','d'])

a    1
b    2
c    3
d    5
dtype: int64

In [4]:
L = {'a':1, 'b':2, 'c':3,'d':4}
pd.Series(L)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
L = {'a':1, 'b':2, 'c':3,'d':4}
S = pd.Series(L, index=['a','b','c','d','e','f','g'])

In [6]:
S['c']

3.0

In [8]:
S['g']=100
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [9]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [10]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

In [11]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco','baltimore','miami','douglas','boston']
}

raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [12]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [13]:
pd.DataFrame(raw_data, columns = ['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [14]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [17]:
df['first_name']

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [18]:
df[['age','city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [20]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [21]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [22]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [23]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [24]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [25]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [26]:
df.loc[['b','c','d'],['last_name','age']]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [27]:
df.iloc[[1,2,3],[1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [28]:
df.iloc[1:3,[1,2]]

  last_name  age
b  jacobson   52
c       ali   36

In [29]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [30]:
df.iloc[1:4,1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [31]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [33]:
df['age']

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [34]:
df.loc[df['age']>40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [35]:
df.loc[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [36]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [37]:
df[df.last_name == 'ali']['age']

c    36
Name: age, dtype: int64

In [38]:

sal = pd.read_csv('Salaries1.csv', index_col = 0)
df = pd.DataFrame(sal)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [40]:
# 1. BasePay 평균은 ?
df['BasePay'].mean()

75601.13714620461

In [41]:
# 2. OvertimePay의 최대값은?
df['OvertimePay'].max()

245131.88

In [46]:
# 3. 'JOSEPH DRISCOLL'의 직업은?
df.loc[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [51]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [52]:
df['TotalPayBenefits']

0        567595.43
1        538909.28
2        335279.91
3        332343.61
4        326373.19
           ...
49995    119200.97
49996    119199.74
49997    119196.62
49998    119189.49
49999    119186.62
Name: TotalPayBenefits, Length: 50000, dtype: float64

In [50]:
# 4. 'TotalPayBenefits' 최고금액을 수령하는 사람의 이름은?
df.loc[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [53]:
# 5. 연도별 BasePay의 평균금액은?
df.groupby('Year')['BasePay'].mean()

Year
2011     63595.956517
2012    106964.140280
Name: BasePay, dtype: float64

In [54]:
# 6. 'JobTitle'의 종류는?
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ...,
       'Health Program Planner', 'Social Work Supervisor',
       'Ornamental Iron Worker'], dtype=object)

In [57]:
# 7. 'JobTitle'의 종류 중 가장 많은 JobTitle 상위 5개는 무엇인가?
df['JobTitle'].value_counts().head(5)

TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
Registered Nurse    1003
CUSTODIAN            796
Name: JobTitle, dtype: int64

In [72]:
# 8. 2011년도에 오직 한 사람만 종사하고 있는 JobTitle은?
sal = df.loc[df['Year']==2011]
sal2011 = sal['JobTitle'].value_counts()==1
sal2011[sal2011==True].index

Index(['SENIOR PLAN CHECKER', 'PRINCIPAL MUSEUM PREPARATOR',
       'WIRE ROPE CABLE MAINTENANCE SUPERVISOR',
       'POWER GENERATION TECHNICIAN I', 'GLAZIER SUPERVISOR I',
       'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'CHIEF VICTIM/WITNESS INVESTIGATOR',
       'ASSISTANT DIRECTOR, JUVENILE HALL', 'MAYORAL STAFF V',
       'AIRPORT ASSISTANT DEPUTY DIRECTOR, OPERATIONS',
       ...
       'COURT SUPERVISOR I', 'MENTAL HEALTH HEARING OFFICER',
       'SUPERVISING PARTS STOREKEEPER', 'ACUPUNCTURIST',
       'MEDIA TRAINING SPECIALIST', 'ASSISTANT DIRECTOR, LOG CABIN RANCH',
       'ORTHOPEDIC TECHNICIAN II', 'ROOFER SUPERVISOR I',
       'ASSISTANT RECREATION SUPERVISOR',
       'HEAVY EQUIPMENT OPERATIONS ASSISTANT SUPERVISOR'],
      dtype='object', length=200)

In [ ]:
# 9. 'Chief'라는 직업을 가진 사람의 수는?